### Terraform :rocket:
#### Terraform init
```bash
Initializing the backend...

Successfully configured the backend "azurerm"! Terraform will automatically
use this backend unless the backend configuration changes.
Initializing modules...
Downloading git::ssh://git@github.com/mtnvencenzo/Terraform-Modules.git for aca_cocktails_api...
- aca_cocktails_api in .terraform/modules/aca_cocktails_api/modules/container-app
Downloading git::ssh://git@github.com/mtnvencenzo/Terraform-Modules.git for aca_cocktails_api_availability_test...
- aca_cocktails_api_availability_test in .terraform/modules/aca_cocktails_api_availability_test/modules/appinsights-availability-test
- ai_search_cosmos_index in ai_search_index
Downloading git::ssh://git@github.com/mtnvencenzo/Terraform-Modules.git for ai_search_cosmos_index.ai_search_cocktails_index_simple...
- ai_search_cosmos_index.ai_search_cocktails_index_simple in .terraform/modules/ai_search_cosmos_index.ai_search_cocktails_index_simple/modules/ai-search-cosmos-index-simple
- api_b2c_tenant in b2c_tenant
Downloading git::ssh://git@github.com/mtnvencenzo/Terraform-Modules.git for api_b2c_tenant.frontdoor_endpoint_to_b2c_tenant...
- api_b2c_tenant.frontdoor_endpoint_to_b2c_tenant in .terraform/modules/api_b2c_tenant.frontdoor_endpoint_to_b2c_tenant/modules/frontdoor-cdn-endpoint-with-origin
- api_b2c_tenant.frontdoor_endpoint_to_b2c_tenant.cocktails_cdn_dns_sub_domain_record in .terraform/modules/api_b2c_tenant.frontdoor_endpoint_to_b2c_tenant/modules/dns-sub-domain-record
Downloading git::ssh://git@github.com/mtnvencenzo/Terraform-Modules.git for apim_cocktails_api...
- apim_cocktails_api in .terraform/modules/apim_cocktails_api/modules/apim-api
Downloading git::ssh://git@github.com/mtnvencenzo/Terraform-Modules.git for apim_cocktails_api_cors_policy...
- apim_cocktails_api_cors_policy in .terraform/modules/apim_cocktails_api_cors_policy/modules/apim-cors-policy-fragment
Downloading git::ssh://git@github.com/mtnvencenzo/Terraform-Modules.git for apim_cocktails_api_custom_domain...
- apim_cocktails_api_custom_domain in .terraform/modules/apim_cocktails_api_custom_domain/modules/dns-sub-domain-record
Downloading git::ssh://git@github.com/mtnvencenzo/Terraform-Modules.git for apim_cocktails_api_jwtvalidate_policy...
- apim_cocktails_api_jwtvalidate_policy in .terraform/modules/apim_cocktails_api_jwtvalidate_policy/modules/apim-jwtvalidate-policy-fragment
Downloading git::ssh://git@github.com/mtnvencenzo/Terraform-Modules.git for cocktails_cosmosdb_account...
- cocktails_cosmosdb_account in .terraform/modules/cocktails_cosmosdb_account/modules/cosmos-db-account
Downloading git::ssh://git@github.com/mtnvencenzo/Terraform-Modules.git for cocktails_cosmosdb_database...
- cocktails_cosmosdb_database in .terraform/modules/cocktails_cosmosdb_database/modules/cosmos-db-sql-db
Downloading git::ssh://git@github.com/mtnvencenzo/Terraform-Modules.git for cocktails_servicebus_account_queue...
- cocktails_servicebus_account_queue in .terraform/modules/cocktails_servicebus_account_queue/modules/servicebus-queue
Downloading git::ssh://git@github.com/mtnvencenzo/Terraform-Modules.git for cocktails_servicebus_account_subscription_rule...
- cocktails_servicebus_account_subscription_rule in .terraform/modules/cocktails_servicebus_account_subscription_rule/modules/servicebus-subscription-rule
Downloading git::ssh://git@github.com/mtnvencenzo/Terraform-Modules.git for cocktails_servicebus_account_svc_subscription...
- cocktails_servicebus_account_svc_subscription in .terraform/modules/cocktails_servicebus_account_svc_subscription/modules/servicebus-subscription
Downloading git::ssh://git@github.com/mtnvencenzo/Terraform-Modules.git for cocktails_servicebus_account_topic...
- cocktails_servicebus_account_topic in .terraform/modules/cocktails_servicebus_account_topic/modules/servicebus-topic
Downloading git::ssh://git@github.com/mtnvencenzo/Terraform-Modules.git for cocktails_servicebus_cocktail_ratings_queue...
- cocktails_servicebus_cocktail_ratings_queue in .terraform/modules/cocktails_servicebus_cocktail_ratings_queue/modules/servicebus-queue
Downloading git::ssh://git@github.com/mtnvencenzo/Terraform-Modules.git for cocktails_servicebus_cocktail_ratings_subscription_rule...
- cocktails_servicebus_cocktail_ratings_subscription_rule in .terraform/modules/cocktails_servicebus_cocktail_ratings_subscription_rule/modules/servicebus-subscription-rule
Downloading git::ssh://git@github.com/mtnvencenzo/Terraform-Modules.git for cocktails_servicebus_cocktail_ratings_svc_subscription...
- cocktails_servicebus_cocktail_ratings_svc_subscription in .terraform/modules/cocktails_servicebus_cocktail_ratings_svc_subscription/modules/servicebus-subscription
Downloading git::ssh://git@github.com/mtnvencenzo/Terraform-Modules.git for cocktails_servicebus_cocktail_ratings_topic...
- cocktails_servicebus_cocktail_ratings_topic in .terraform/modules/cocktails_servicebus_cocktail_ratings_topic/modules/servicebus-topic
Downloading git::ssh://git@github.com/mtnvencenzo/Terraform-Modules.git for cocktails_servicebus_email_queue...
- cocktails_servicebus_email_queue in .terraform/modules/cocktails_servicebus_email_queue/modules/servicebus-queue
Downloading git::ssh://git@github.com/mtnvencenzo/Terraform-Modules.git for cocktails_servicebus_email_svc_subscription...
- cocktails_servicebus_email_svc_subscription in .terraform/modules/cocktails_servicebus_email_svc_subscription/modules/servicebus-subscription
Downloading git::ssh://git@github.com/mtnvencenzo/Terraform-Modules.git for cocktails_servicebus_email_topic...
- cocktails_servicebus_email_topic in .terraform/modules/cocktails_servicebus_email_topic/modules/servicebus-topic
Downloading git::ssh://git@github.com/mtnvencenzo/Terraform-Modules.git for cocktails_servicebus_subscription_rule...
- cocktails_servicebus_subscription_rule in .terraform/modules/cocktails_servicebus_subscription_rule/modules/servicebus-subscription-rule
Downloading git::ssh://git@github.com/mtnvencenzo/Terraform-Modules.git for storage_container_account_avatars...
- storage_container_account_avatars in .terraform/modules/storage_container_account_avatars/modules/storage-container
Initializing provider plugins...
- Finding hashicorp/azurerm versions matching "4.24.0"...
- Finding hashicorp/azuread versions matching "3.1.0"...
- Finding latest version of hashicorp/random...
- Finding mastercard/restapi versions matching "2.0.1"...
- Finding latest version of hashicorp/null...
- Finding latest version of hashicorp/time...
- Installing hashicorp/azurerm v4.24.0...
- Installed hashicorp/azurerm v4.24.0 (signed by HashiCorp)
- Installing hashicorp/azuread v3.1.0...
- Installed hashicorp/azuread v3.1.0 (signed by HashiCorp)
- Installing hashicorp/random v3.7.2...
- Installed hashicorp/random v3.7.2 (signed by HashiCorp)
- Installing mastercard/restapi v2.0.1...
- Installed mastercard/restapi v2.0.1 (self-signed, key ID DCB8C431D71C30AB)
- Installing hashicorp/null v3.2.4...
- Installed hashicorp/null v3.2.4 (signed by HashiCorp)
- Installing hashicorp/time v0.13.1...
- Installed hashicorp/time v0.13.1 (signed by HashiCorp)
Partner and community providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://developer.hashicorp.com/terraform/cli/plugins/signing
Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

```
#### Terraform format
```bash

```
#### Terraform validate
```bash

Warning: Argument is deprecated

  with module.api_b2c_tenant.azuread_service_principal_password.cocktails_api_app_registration_graph_api_secret,
  on b2c_tenant/api_app_registration.tf line 83, in resource "azuread_service_principal_password" "cocktails_api_app_registration_graph_api_secret":
  83:   end_date_relative    = "2yr"

The `end_date_relative` property is deprecated and will be removed in a
future version of the AzureAD provider. Please instead use the Terraform
`timeadd()` function to calculate a value for the `end_date` property.

Warning: Deprecated attribute

  on .terraform/modules/storage_container_account_avatars/modules/storage-container/main.tf line 13, in resource "azurerm_role_assignment" "storage_container_role_assignments":
  13:   scope                = azurerm_storage_container.storage_container.resource_manager_id

The attribute "resource_manager_id" is deprecated. Refer to the provider
documentation for details.
Success! The configuration is valid, but there were some validation warnings
as shown above.


```
#### Terraform plan
```bash
Acquiring state lock. This may take a few moments...
random_password.cocktails_api_mcp_subscription_keys[0]: Refreshing state... [id=none]
module.api_b2c_tenant.random_uuid.cocktails_api_write_own_account_scope_id: Refreshing state... [id=6898f74f-921d-18da-e885-920448ff1914]
random_password.cocktails_api_cezzis_com_subscription_keys[1]: Refreshing state... [id=none]
random_password.cocktails_api_devops_subscription_keys[1]: Refreshing state... [id=none]
random_password.cocktails_api_devops_subscription_keys[0]: Refreshing state... [id=none]
random_password.cocktails_api_cezzis_com_subscription_keys[0]: Refreshing state... [id=none]
random_password.cocktails_api_apimhostkey: Refreshing state... [id=none]
random_password.cocktails_api_mcp_subscription_keys[1]: Refreshing state... [id=none]
module.api_b2c_tenant.module.frontdoor_endpoint_to_b2c_tenant.module.cocktails_cdn_dns_sub_domain_record.null_resource.dns_sub_domain_txt_verification_record_previous: Refreshing state... [id=6069434220630327695]
module.api_b2c_tenant.random_uuid.cocktails_api_read_own_account_scope_id: Refreshing state... [id=771e9640-5432-2f31-d214-15c9206a8665]
random_password.cocktails_api_localusage_subscription_keys[0]: Refreshing state... [id=none]
random_password.cocktails_api_localusage_subscription_keys[1]: Refreshing state... [id=none]
module.api_b2c_tenant.module.frontdoor_endpoint_to_b2c_tenant.module.cocktails_cdn_dns_sub_domain_record.time_sleep.dns_sub_domain_txt_verification_record_wait_30_seconds: Refreshing state... [id=2025-06-19T21:07:46Z]
module.api_b2c_tenant.module.frontdoor_endpoint_to_b2c_tenant.module.cocktails_cdn_dns_sub_domain_record.null_resource.dns_sub_domain_txt_verification_record_continuation: Refreshing state... [id=6264348960067218243]
module.api_b2c_tenant.data.azuread_application_published_app_ids.well_known: Reading...
module.api_b2c_tenant.data.azuread_application_published_app_ids.well_known: Read complete after 0s [id=appIds]
module.api_b2c_tenant.azuread_service_principal.msgraph: Refreshing state... [id=/servicePrincipals/d123f51a-db9a-4da1-a8f8-fd1a91260b8d]
module.api_b2c_tenant.azuread_application.cocktails_api_app_registration: Refreshing state... [id=/applications/11692eb8-014a-46fc-a9af-860da3b09d98]
module.api_b2c_tenant.azuread_service_principal.cocktails_api_app_registration_serviceprincipal: Refreshing state... [id=/servicePrincipals/6ee39f17-bff2-4c26-8573-e113b6fef1ec]
module.api_b2c_tenant.azuread_app_role_assignment.cocktails_api_app_registration_serviceprincipal_app_rw_all_role_assignment: Refreshing state... [id=/servicePrincipals/d123f51a-db9a-4da1-a8f8-fd1a91260b8d/appRoleAssignedTo/F5_jbvK_JkyFc-ETtv7x7ENotPv41fBFhrwvhz1JfUU]
module.api_b2c_tenant.azuread_service_principal_password.cocktails_api_app_registration_graph_api_secret: Refreshing state... [id=6ee39f17-bff2-4c26-8573-e113b6fef1ec/password/ee1e1a98-0188-4a23-a17d-6a9d855bcbb4]
data.azurerm_resource_group.cocktails_resource_group: Reading...
data.azurerm_resource_group.global_network_resource_group: Reading...
data.azurerm_resource_group.global_shared_resource_group: Reading...
data.azurerm_resource_group.cocktails_global_resource_group: Reading...
data.azurerm_application_insights.appi: Reading...
data.azurerm_client_config.current: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD03MjBhZTE4MC0zNWM4LTQ1ODktYTlkMS1iNjNkOWZkYzhmZmM7b2JqZWN0SWQ9ZmZlZmFiYWMtZmRhNC00ZTVkLWFlZTUtYWZlNTBkYzdkYTkzO3N1YnNjcmlwdGlvbklkPTFkOWVjYzAwLTI0MmEtNDYwZC04YjA4LWI3MWRiMTlmMDk0ZTt0ZW5hbnRJZD1hYmM0OTBlNS0zOTViLTRkYjEtOWQ5Zi0xODQzNGE0NTI2M2Q=]
data.azurerm_resource_group.global_network_resource_group: Read complete after 1s [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-glo-network-001]
data.azurerm_virtual_network.global_virtual_network: Reading...
data.azurerm_subnet.container_app_environment_subnet: Reading...
data.azurerm_resource_group.cocktails_resource_group: Read complete after 1s [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-prd-cocktails-001]
data.azurerm_key_vault.cocktails_keyvault: Reading...
module.aca_cocktails_api.azurerm_user_assigned_identity.aca_user_identity: Refreshing state... [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-prd-cocktails-001/providers/Microsoft.ManagedIdentity/userAssignedIdentities/mi-vec-eus-prd-cocktailsapi-001]
data.azurerm_storage_account.cocktails_storage_account: Reading...
data.azurerm_resource_group.cocktails_global_resource_group: Read complete after 1s [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-glo-cocktails-001]
data.azurerm_dns_zone.cezzis_dns_zone: Reading...
data.azurerm_resource_group.global_shared_resource_group: Read complete after 1s [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-glo-shared-001]
data.azurerm_search_service.ai_search_service: Reading...
data.azurerm_container_app_environment.cae_shared: Reading...
data.azurerm_cdn_frontdoor_profile.global_shared_cdn: Reading...
data.azurerm_key_vault.cocktails_keyvault: Read complete after 0s [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-prd-cocktails-001/providers/Microsoft.KeyVault/vaults/kv-vec-eus-prd-cockti-1]
data.azurerm_api_management.apim_shared: Reading...
data.azurerm_virtual_network.global_virtual_network: Read complete after 0s [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-glo-network-001/providers/Microsoft.Network/virtualNetworks/vnet-vec-eus-glo-network-001]
data.azurerm_container_registry.shared_acr: Reading...
data.azurerm_application_insights.appi: Read complete after 1s [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-glo-shared-001/providers/Microsoft.Insights/components/appi-vec-eus-glo-shared-001]
data.azurerm_servicebus_namespace.servicebus_namespace: Reading...
data.azurerm_dns_zone.cezzis_dns_zone: Read complete after 0s [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-glo-cocktails-001/providers/Microsoft.Network/dnsZones/cezzis.com]
azurerm_key_vault_secret.recaptcha_cezzi_site_secret: Refreshing state... [id=https://kv-vec-eus-prd-cockti-1.vault.azure.net/secrets/recaptcha-cezzi-site-secret/51433a6ccb174080b8c62b1af1fe325a]
data.azurerm_api_management.apim_shared: Read complete after 0s [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-glo-shared-001/providers/Microsoft.ApiManagement/service/apim-vec-eus-glo-shared-001]
azurerm_key_vault_secret.cocktails_api_cezzis_com_subscription_primary_key: Refreshing state... [id=https://kv-vec-eus-prd-cockti-1.vault.azure.net/secrets/cocktails-api-cezzis-com-subscription-primary-key/aeb63cee3ed84f5e8a2109b0bf69fc67]
data.azurerm_subnet.container_app_environment_subnet: Read complete after 0s [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-glo-network-001/providers/Microsoft.Network/virtualNetworks/vnet-vec-eus-glo-network-001/subnets/snet-vec-eus-glo-sharedcontainers-001]
azurerm_key_vault_secret.cocktails_api_mcp_subscription_primary_key: Refreshing state... [id=https://kv-vec-eus-prd-cockti-1.vault.azure.net/secrets/cocktails-api-mcp-subscription-primary-key/d0c3f954184e4b108dc02d510006c4f2]
data.azurerm_storage_account.cocktails_storage_account: Read complete after 0s [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-prd-cocktails-001/providers/Microsoft.Storage/storageAccounts/stvecprdcocktails001]
azurerm_key_vault_secret.cocktails_api_devops_subscription_primary_key: Refreshing state... [id=https://kv-vec-eus-prd-cockti-1.vault.azure.net/secrets/cocktails-api-devops-subscription-primary-key/6f2b7c2e55524ab2939948df97623475]
data.azurerm_cdn_frontdoor_profile.global_shared_cdn: Read complete after 0s [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-glo-shared-001/providers/Microsoft.Cdn/profiles/afd-vec-eus-glo-shared-001]
azurerm_key_vault_secret.cocktails_api_app_registration_graph_api_secret: Refreshing state... [id=https://kv-vec-eus-prd-cockti-1.vault.azure.net/secrets/cocktails-api-app-registration-graph-api-secret/9722436c04984234868b964566c83b2e]
azurerm_key_vault_secret.zoho_email_cezzi_email_app_password: Refreshing state... [id=https://kv-vec-eus-prd-cockti-1.vault.azure.net/secrets/zoho-email-cezzi-email-app-password/9493d5cb2e8845eba5ce8d4efcb725cd]
azurerm_key_vault_secret.cocktails_api_apimhostkey: Refreshing state... [id=https://kv-vec-eus-prd-cockti-1.vault.azure.net/secrets/cocktails-api-apimhostkey/76352424a34e41ac9ed2438bf8830936]
module.aca_cocktails_api.azurerm_key_vault_access_policy.aca_keyvault_policy[0]: Refreshing state... [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-prd-cocktails-001/providers/Microsoft.KeyVault/vaults/kv-vec-eus-prd-cockti-1/objectId/117c4d16-1823-4505-a7b8-30059b66436b]
module.aca_cocktails_api_availability_test.azurerm_application_insights_standard_web_test.appinsights_standard_availability_test: Refreshing state... [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-glo-shared-001/providers/Microsoft.Insights/webTests/avt-vec-eus-prd-cocktailsapi-001]
data.azurerm_container_app_environment.cae_shared: Read complete after 1s [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-glo-shared-001/providers/Microsoft.App/managedEnvironments/cae-vec-eus-glo-shared-001]
module.cocktails_cosmosdb_account.azurerm_cosmosdb_account.cosmosdb_account: Refreshing state... [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-prd-cocktails-001/providers/Microsoft.DocumentDB/databaseAccounts/cosmos-vec-eus-prd-cocktails-001]
module.storage_container_account_avatars.azurerm_storage_container.storage_container: Refreshing state... [id=https://stvecprdcocktails001.blob.core.windows.net/account-avatars]
data.azurerm_container_registry.shared_acr: Read complete after 1s [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-glo-shared-001/providers/Microsoft.ContainerRegistry/registries/acrveceusgloshared001]
module.api_b2c_tenant.module.frontdoor_endpoint_to_b2c_tenant.azurerm_cdn_frontdoor_endpoint.frontdoor_cdn_endpoint: Refreshing state... [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-glo-shared-001/providers/Microsoft.Cdn/profiles/afd-vec-eus-glo-shared-001/afdEndpoints/afde-vec-eus-prd-cocktailslogin-001]
module.api_b2c_tenant.module.frontdoor_endpoint_to_b2c_tenant.azurerm_cdn_frontdoor_origin_group.frontdoor_cdn_origin_group: Refreshing state... [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-glo-shared-001/providers/Microsoft.Cdn/profiles/afd-vec-eus-glo-shared-001/originGroups/afdog-vec-eus-prd-cocktailslogin-001]
module.api_b2c_tenant.module.frontdoor_endpoint_to_b2c_tenant.azurerm_cdn_frontdoor_rule_set.frontdoor_cdn_cors_ruleset[0]: Refreshing state... [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-glo-shared-001/providers/Microsoft.Cdn/profiles/afd-vec-eus-glo-shared-001/ruleSets/prdcocktailslogincors]
module.api_b2c_tenant.module.frontdoor_endpoint_to_b2c_tenant.azurerm_cdn_frontdoor_custom_domain.frontdoor_cdn_custom_domain[0]: Refreshing state... [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-glo-shared-001/providers/Microsoft.Cdn/profiles/afd-vec-eus-glo-shared-001/customDomains/login-cezzis-com]
data.azurerm_servicebus_namespace.servicebus_namespace: Read complete after 1s [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-glo-shared-001/providers/Microsoft.ServiceBus/namespaces/sb-vec-eus-glo-shared-001]
module.aca_cocktails_api.azurerm_role_assignment.aca_user_identity_acr_role_assignment: Refreshing state... [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-glo-shared-001/providers/Microsoft.ContainerRegistry/registries/acrveceusgloshared001/providers/Microsoft.Authorization/roleAssignments/f1360115-9c7c-67da-8083-a6579300be6c]
module.cocktails_servicebus_email_topic.azurerm_servicebus_topic.servicebus_topic: Refreshing state... [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-glo-shared-001/providers/Microsoft.ServiceBus/namespaces/sb-vec-eus-glo-shared-001/topics/sbt-vec-eus-prd-cocktails-email-001]
module.cocktails_servicebus_account_queue.azurerm_servicebus_queue.servicebus_queue: Refreshing state... [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-glo-shared-001/providers/Microsoft.ServiceBus/namespaces/sb-vec-eus-glo-shared-001/queues/sbq-vec-eus-prd-cocktails-account-001]
module.cocktails_servicebus_email_queue.azurerm_servicebus_queue.servicebus_queue: Refreshing state... [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-glo-shared-001/providers/Microsoft.ServiceBus/namespaces/sb-vec-eus-glo-shared-001/queues/sbq-vec-eus-prd-cocktails-email-001]
module.cocktails_servicebus_cocktail_ratings_topic.azurerm_servicebus_topic.servicebus_topic: Refreshing state... [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-glo-shared-001/providers/Microsoft.ServiceBus/namespaces/sb-vec-eus-glo-shared-001/topics/sbt-vec-eus-prd-cocktails-cocktail-ratings-001]
module.cocktails_servicebus_account_topic.azurerm_servicebus_topic.servicebus_topic: Refreshing state... [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-glo-shared-001/providers/Microsoft.ServiceBus/namespaces/sb-vec-eus-glo-shared-001/topics/sbt-vec-eus-prd-cocktails-account-001]
module.cocktails_servicebus_cocktail_ratings_queue.azurerm_servicebus_queue.servicebus_queue: Refreshing state... [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-glo-shared-001/providers/Microsoft.ServiceBus/namespaces/sb-vec-eus-glo-shared-001/queues/sbq-vec-eus-prd-cocktails-cocktail-ratings-001]
module.api_b2c_tenant.module.frontdoor_endpoint_to_b2c_tenant.azurerm_cdn_frontdoor_origin.frontdoor_cdn_origin: Refreshing state... [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-glo-shared-001/providers/Microsoft.Cdn/profiles/afd-vec-eus-glo-shared-001/originGroups/afdog-vec-eus-prd-cocktailslogin-001/origins/afdo-vec-eus-prd-cocktailslogin-001]
azurerm_role_assignment.cocktails_api_access_cocktails_servicebus_email_topic: Refreshing state... [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-glo-shared-001/providers/Microsoft.ServiceBus/namespaces/sb-vec-eus-glo-shared-001/topics/sbt-vec-eus-prd-cocktails-email-001/providers/Microsoft.Authorization/roleAssignments/d424a3eb-3224-d5ff-7b86-00f5466fd38a]
azurerm_role_assignment.cocktails_api_access_cocktails_servicebus_account_queue: Refreshing state... [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-glo-shared-001/providers/Microsoft.ServiceBus/namespaces/sb-vec-eus-glo-shared-001/queues/sbq-vec-eus-prd-cocktails-account-001/providers/Microsoft.Authorization/roleAssignments/e673a427-e585-1ea1-19e5-7d788228a831]
module.api_b2c_tenant.module.frontdoor_endpoint_to_b2c_tenant.module.cocktails_cdn_dns_sub_domain_record.azurerm_dns_txt_record.dns_sub_domain_txt_verification_record: Refreshing state... [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-glo-cocktails-001/providers/Microsoft.Network/dnsZones/cezzis.com/TXT/_dnsauth.login]
azurerm_role_assignment.cocktails_api_access_cocktails_servicebus_email_queue: Refreshing state... [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-glo-shared-001/providers/Microsoft.ServiceBus/namespaces/sb-vec-eus-glo-shared-001/queues/sbq-vec-eus-prd-cocktails-email-001/providers/Microsoft.Authorization/roleAssignments/279abdbf-4194-fa68-9dcf-283ead463d04]
data.azurerm_search_service.ai_search_service: Read complete after 2s [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-glo-shared-001/providers/Microsoft.Search/searchServices/srch-vec-eus-glo-shared-001]
module.cocktails_servicebus_email_svc_subscription.azurerm_servicebus_subscription.servicebus_subscription: Refreshing state... [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-glo-shared-001/providers/Microsoft.ServiceBus/namespaces/sb-vec-eus-glo-shared-001/topics/sbt-vec-eus-prd-cocktails-email-001/subscriptions/sbs-vec-eus-prd-cocktails-email-svc-001]
azurerm_role_assignment.cocktails_api_access_cocktails_servicebus_account_topic: Refreshing state... [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-glo-shared-001/providers/Microsoft.ServiceBus/namespaces/sb-vec-eus-glo-shared-001/topics/sbt-vec-eus-prd-cocktails-account-001/providers/Microsoft.Authorization/roleAssignments/fe44ef0d-9cb9-cb8a-ff46-1ab4dd7a4c3d]
module.cocktails_servicebus_account_svc_subscription.azurerm_servicebus_subscription.servicebus_subscription: Refreshing state... [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-glo-shared-001/providers/Microsoft.ServiceBus/namespaces/sb-vec-eus-glo-shared-001/topics/sbt-vec-eus-prd-cocktails-account-001/subscriptions/sbs-vec-eus-prd-cocktails-account-svc-001]
module.storage_container_account_avatars.azurerm_role_assignment.storage_container_role_assignments["Storage Blob Data Contributor-117c4d16-1823-4505-a7b8-30059b66436b"]: Refreshing state... [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-prd-cocktails-001/providers/Microsoft.Storage/storageAccounts/stvecprdcocktails001/blobServices/default/containers/account-avatars/providers/Microsoft.Authorization/roleAssignments/ab452fca-b0fa-39fe-454c-90bb701c9a3c]
module.storage_container_account_avatars.azurerm_role_assignment.storage_container_role_assignments["Storage Blob Data Reader-117c4d16-1823-4505-a7b8-30059b66436b"]: Refreshing state... [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-prd-cocktails-001/providers/Microsoft.Storage/storageAccounts/stvecprdcocktails001/blobServices/default/containers/account-avatars/providers/Microsoft.Authorization/roleAssignments/86238c71-203e-19da-aeab-880fdd8d0b1b]
azurerm_role_assignment.cocktails_api_access_cocktails_servicebus_cocktail_ratings_topic: Refreshing state... [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-glo-shared-001/providers/Microsoft.ServiceBus/namespaces/sb-vec-eus-glo-shared-001/topics/sbt-vec-eus-prd-cocktails-cocktail-ratings-001/providers/Microsoft.Authorization/roleAssignments/1385c337-89de-738f-698d-fdf7bc168a5e]
azurerm_role_assignment.cocktails_api_access_cocktails_servicebus_cocktail_ratings_queue: Refreshing state... [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-glo-shared-001/providers/Microsoft.ServiceBus/namespaces/sb-vec-eus-glo-shared-001/queues/sbq-vec-eus-prd-cocktails-cocktail-ratings-001/providers/Microsoft.Authorization/roleAssignments/829265e7-f424-dcf4-7f9e-fddb1105f789]
module.api_b2c_tenant.module.frontdoor_endpoint_to_b2c_tenant.module.cocktails_cdn_dns_sub_domain_record.azurerm_dns_cname_record.dns_sub_domain_sname_record: Refreshing state... [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-glo-cocktails-001/providers/Microsoft.Network/dnsZones/cezzis.com/CNAME/login]
module.cocktails_servicebus_cocktail_ratings_svc_subscription.azurerm_servicebus_subscription.servicebus_subscription: Refreshing state... [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-glo-shared-001/providers/Microsoft.ServiceBus/namespaces/sb-vec-eus-glo-shared-001/topics/sbt-vec-eus-prd-cocktails-cocktail-ratings-001/subscriptions/sbs-vec-eus-prd-cocktails-cocktail-ratings-svc-001]
module.api_b2c_tenant.module.frontdoor_endpoint_to_b2c_tenant.azurerm_cdn_frontdoor_route.frontdoor_cdn_route: Refreshing state... [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-glo-shared-001/providers/Microsoft.Cdn/profiles/afd-vec-eus-glo-shared-001/afdEndpoints/afde-vec-eus-prd-cocktailslogin-001/routes/afdr-vec-eus-prd-cocktailslogin-001]
module.api_b2c_tenant.module.frontdoor_endpoint_to_b2c_tenant.azurerm_cdn_frontdoor_rule.frontdoor_cdn_cors_ruleset_origin_rules["https://cezzis.com"]: Refreshing state... [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-glo-shared-001/providers/Microsoft.Cdn/profiles/afd-vec-eus-glo-shared-001/ruleSets/prdcocktailslogincors/rules/originrule1]
module.api_b2c_tenant.module.frontdoor_endpoint_to_b2c_tenant.azurerm_cdn_frontdoor_rule.frontdoor_cdn_cors_ruleset_origin_rules["http://localhost:4000"]: Refreshing state... [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-glo-shared-001/providers/Microsoft.Cdn/profiles/afd-vec-eus-glo-shared-001/ruleSets/prdcocktailslogincors/rules/originrule2]
module.api_b2c_tenant.module.frontdoor_endpoint_to_b2c_tenant.azurerm_cdn_frontdoor_rule.frontdoor_cdn_cors_ruleset_origin_rules["https://www.cezzis.com"]: Refreshing state... [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-glo-shared-001/providers/Microsoft.Cdn/profiles/afd-vec-eus-glo-shared-001/ruleSets/prdcocktailslogincors/rules/originrule0]
module.api_b2c_tenant.module.frontdoor_endpoint_to_b2c_tenant.azurerm_cdn_frontdoor_rule.frontdoor_cdn_cors_ruleset_origin_rules["https://localhost:4001"]: Refreshing state... [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-glo-shared-001/providers/Microsoft.Cdn/profiles/afd-vec-eus-glo-shared-001/ruleSets/prdcocktailslogincors/rules/originrule3]
module.cocktails_cosmosdb_account.azurerm_cosmosdb_sql_role_definition.cosmosdb_custom_contributor_role_definition: Refreshing state... [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-prd-cocktails-001/providers/Microsoft.DocumentDB/databaseAccounts/cosmos-vec-eus-prd-cocktails-001/sqlRoleDefinitions/f1aa2c7b-36eb-9179-8f12-7b7e57e3780b]
module.cocktails_servicebus_subscription_rule.azurerm_servicebus_subscription_rule.servucebus_subscription_rule: Refreshing state... [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-glo-shared-001/providers/Microsoft.ServiceBus/namespaces/sb-vec-eus-glo-shared-001/topics/sbt-vec-eus-prd-cocktails-email-001/subscriptions/sbs-vec-eus-prd-cocktails-email-svc-001/rules/label-email-svc]
module.cocktails_cosmosdb_account.azurerm_cosmosdb_sql_role_definition.cosmosdb_custom_reader_role_definition: Refreshing state... [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-prd-cocktails-001/providers/Microsoft.DocumentDB/databaseAccounts/cosmos-vec-eus-prd-cocktails-001/sqlRoleDefinitions/8fcffd18-8a39-8a04-c3f7-2b7f4ac43593]
module.cocktails_cosmosdb_account.azurerm_role_assignment.cosmos_search_account_reader_role_assignment["5e688122-9cf3-4b97-98d8-8f14e62466cc"]: Refreshing state... [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-prd-cocktails-001/providers/Microsoft.DocumentDB/databaseAccounts/cosmos-vec-eus-prd-cocktails-001/providers/Microsoft.Authorization/roleAssignments/8fd162d7-0aec-d709-8ece-3b5df6e60ee6]
module.cocktails_servicebus_cocktail_ratings_subscription_rule.azurerm_servicebus_subscription_rule.servucebus_subscription_rule: Refreshing state... [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-glo-shared-001/providers/Microsoft.ServiceBus/namespaces/sb-vec-eus-glo-shared-001/topics/sbt-vec-eus-prd-cocktails-cocktail-ratings-001/subscriptions/sbs-vec-eus-prd-cocktails-cocktail-ratings-svc-001/rules/label-cocktail-ratings-svc]
module.cocktails_servicebus_account_subscription_rule.azurerm_servicebus_subscription_rule.servucebus_subscription_rule: Refreshing state... [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-glo-shared-001/providers/Microsoft.ServiceBus/namespaces/sb-vec-eus-glo-shared-001/topics/sbt-vec-eus-prd-cocktails-account-001/subscriptions/sbs-vec-eus-prd-cocktails-account-svc-001/rules/label-account-svc]
module.api_b2c_tenant.module.frontdoor_endpoint_to_b2c_tenant.azurerm_cdn_frontdoor_custom_domain_association.frontdoor_cdn_custom_domain_route_association[0]: Refreshing state... [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-glo-shared-001/providers/Microsoft.Cdn/profiles/afd-vec-eus-glo-shared-001/associations/login-cezzis-com]
module.aca_cocktails_api.azurerm_container_app.aca: Refreshing state... [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-prd-cocktails-001/providers/Microsoft.App/containerApps/aca-vec-eus-prd-cocktailsapi-001]
module.cocktails_cosmosdb_account.azurerm_cosmosdb_sql_role_assignment.sql_custom_reader_role_assignments["3335b819-a0b0-4c0d-a180-79ec100f8930"]: Refreshing state... [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-prd-cocktails-001/providers/Microsoft.DocumentDB/databaseAccounts/cosmos-vec-eus-prd-cocktails-001/sqlRoleAssignments/3335b819-a0b0-4c0d-a180-79ec100f8930]
module.cocktails_cosmosdb_database.azurerm_cosmosdb_sql_database.sql_db: Refreshing state... [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-prd-cocktails-001/providers/Microsoft.DocumentDB/databaseAccounts/cosmos-vec-eus-prd-cocktails-001/sqlDatabases/cocktails-db]
module.aca_cocktails_api.azurerm_container_app_environment_dapr_component.aca_dapr_components["pubsub-sb-topics-cocktail-ratings"]: Refreshing state... [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-glo-shared-001/providers/Microsoft.App/managedEnvironments/cae-vec-eus-glo-shared-001/daprComponents/pubsub-sb-topics-cocktail-ratings]
module.aca_cocktails_api.azurerm_container_app_environment_dapr_component.aca_dapr_components["binding-cocktails-blob-account-avatars"]: Refreshing state... [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-glo-shared-001/providers/Microsoft.App/managedEnvironments/cae-vec-eus-glo-shared-001/daprComponents/binding-cocktails-blob-account-avatars]
module.aca_cocktails_api.azurerm_container_app_environment_dapr_component.aca_dapr_components["pubsub-sb-queues-cocktail-ratings"]: Refreshing state... [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-glo-shared-001/providers/Microsoft.App/managedEnvironments/cae-vec-eus-glo-shared-001/daprComponents/pubsub-sb-queues-cocktail-ratings]
module.aca_cocktails_api.azurerm_container_app_environment_dapr_component.aca_dapr_components["pubsub-sb-topics-cocktails-account"]: Refreshing state... [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-glo-shared-001/providers/Microsoft.App/managedEnvironments/cae-vec-eus-glo-shared-001/daprComponents/pubsub-sb-topics-cocktails-account]
module.aca_cocktails_api.azurerm_container_app_environment_dapr_component.aca_dapr_components["pubsub-sb-queues-cocktails-account"]: Refreshing state... [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-glo-shared-001/providers/Microsoft.App/managedEnvironments/cae-vec-eus-glo-shared-001/daprComponents/pubsub-sb-queues-cocktails-account]
module.aca_cocktails_api.azurerm_container_app_environment_dapr_component.aca_dapr_components["pubsub-sb-topics-cocktails-email"]: Refreshing state... [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-glo-shared-001/providers/Microsoft.App/managedEnvironments/cae-vec-eus-glo-shared-001/daprComponents/pubsub-sb-topics-cocktails-email]
module.aca_cocktails_api.azurerm_container_app_environment_dapr_component.aca_dapr_components["pubsub-sb-queues-cocktails-email"]: Refreshing state... [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-glo-shared-001/providers/Microsoft.App/managedEnvironments/cae-vec-eus-glo-shared-001/daprComponents/pubsub-sb-queues-cocktails-email]
module.cocktails_cosmosdb_database.azurerm_cosmosdb_sql_role_assignment.sql_db_role_assignments["24d5c255-8508-4ea2-941e-7044fe5db968"]: Refreshing state... [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-prd-cocktails-001/providers/Microsoft.DocumentDB/databaseAccounts/cosmos-vec-eus-prd-cocktails-001/sqlRoleAssignments/24d5c255-8508-4ea2-941e-7044fe5db968]
module.cocktails_cosmosdb_database.azurerm_cosmosdb_sql_role_assignment.sql_db_role_assignments["37c0645e-bc81-43cd-9607-2377e2660d2a"]: Refreshing state... [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-prd-cocktails-001/providers/Microsoft.DocumentDB/databaseAccounts/cosmos-vec-eus-prd-cocktails-001/sqlRoleAssignments/37c0645e-bc81-43cd-9607-2377e2660d2a]
module.cocktails_cosmosdb_database.azurerm_cosmosdb_sql_container.sql_containers["cocktails-ingredient"]: Refreshing state... [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-prd-cocktails-001/providers/Microsoft.DocumentDB/databaseAccounts/cosmos-vec-eus-prd-cocktails-001/sqlDatabases/cocktails-db/containers/cocktails-ingredient]
module.cocktails_cosmosdb_database.azurerm_cosmosdb_sql_container.sql_containers["accounts-account"]: Refreshing state... [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-prd-cocktails-001/providers/Microsoft.DocumentDB/databaseAccounts/cosmos-vec-eus-prd-cocktails-001/sqlDatabases/cocktails-db/containers/accounts-account]
module.cocktails_cosmosdb_database.azurerm_cosmosdb_sql_container.sql_containers["cocktails-cocktail"]: Refreshing state... [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-prd-cocktails-001/providers/Microsoft.DocumentDB/databaseAccounts/cosmos-vec-eus-prd-cocktails-001/sqlDatabases/cocktails-db/containers/cocktails-cocktail]
module.ai_search_cosmos_index.module.ai_search_cocktails_index_simple.restapi_object.cosmos_datasource: Refreshing state... [id=ds-cosmos-cocktails]
module.ai_search_cosmos_index.module.ai_search_cocktails_index_simple.restapi_object.cosmos_standard_lucene_index: Refreshing state... [id=idx-cosmos-cocktails-standard-lucene]
module.ai_search_cosmos_index.module.ai_search_cocktails_index_simple.restapi_object.cosmos_standard_lucene_indexer: Refreshing state... [id=idxer-cosmos-cocktails-standard-lucene]
module.ai_search_cosmos_index.module.ai_search_cocktails_index_simple.azurerm_role_assignment.search_index_reader["117c4d16-1823-4505-a7b8-30059b66436b"]: Refreshing state... [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-glo-shared-001/providers/Microsoft.Search/searchServices/srch-vec-eus-glo-shared-001/providers/Microsoft.Authorization/roleAssignments/cfe9e3d8-d51e-f695-0640-4ebc066a0c50]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # azurerm_key_vault_access_policy.apim_keyvault_policy will be created
  + resource "azurerm_key_vault_access_policy" "apim_keyvault_policy" {
      + id                 = (known after apply)
      + key_permissions    = [
          + "Get",
          + "List",
        ]
      + key_vault_id       = "/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-prd-cocktails-001/providers/Microsoft.KeyVault/vaults/kv-vec-eus-prd-cockti-1"
      + object_id          = "f5d45d58-786f-42cc-9852-6aafa7de5180"
      + secret_permissions = [
          + "Get",
          + "List",
        ]
      + tenant_id          = "abc490e5-395b-4db1-9d9f-18434a45263d"
    }

  # module.aca_cocktails_api.azurerm_container_app.aca will be updated in-place
  ~ resource "azurerm_container_app" "aca" {
        id                            = "/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-prd-cocktails-001/providers/Microsoft.App/containerApps/aca-vec-eus-prd-cocktailsapi-001"
        name                          = "aca-vec-eus-prd-cocktailsapi-001"
        tags                          = {
            "Application" = "cocktails"
            "Environment" = "prd"
            "Owner"       = "cocktails.api"
            "Product"     = "cezzis"
        }
        # (10 unchanged attributes hidden)

      ~ template {
            # (4 unchanged attributes hidden)

          ~ container {
              ~ image             = "acrveceusgloshared001.azurecr.io/cocktailsapi:cdef136583a211a26c530e59e0d78bb2838c6eee" -> "acrveceusgloshared001.azurecr.io/cocktailsapi:92d2d8379cdd29fd7637fc3122b5bf1f6f01a31b"
                name              = "cocktails-api"
                # (5 unchanged attributes hidden)

                # (45 unchanged blocks hidden)
            }
        }

        # (8 unchanged blocks hidden)
    }

  # module.apim_cocktails_api.azurerm_api_management_api.apim_api_version will be created
  + resource "azurerm_api_management_api" "apim_api_version" {
      + api_management_name   = "apim-vec-eus-glo-shared-001"
      + api_type              = "http"
      + display_name          = "Prd Cocktails Api"
      + id                    = (known after apply)
      + is_current            = (known after apply)
      + is_online             = (known after apply)
      + name                  = "prd-cocktails-api-v1"
      + path                  = "prd/cocktails/api"
      + protocols             = [
          + "https",
        ]
      + resource_group_name   = "rg-vec-eus-glo-shared-001"
      + revision              = "v1"
      + service_url           = "https://aca-vec-eus-prd-cocktailsapi-001.proudfield-08e1f932.eastus.azurecontainerapps.io/api/v1"
      + subscription_required = true
      + version               = "v1"
      + version_description   = "Prd Cocktails Api v1"
      + version_set_id        = (known after apply)

      + subscription_key_parameter_names {
          + header = "X-Key"
          + query  = "x-key"
        }
    }

  # module.apim_cocktails_api.azurerm_api_management_api_diagnostic.apim_api_diagnostic[0] will be created
  + resource "azurerm_api_management_api_diagnostic" "apim_api_diagnostic" {
      + always_log_errors         = true
      + api_management_logger_id  = (known after apply)
      + api_management_name       = "apim-vec-eus-glo-shared-001"
      + api_name                  = "prd-cocktails-api-v1"
      + http_correlation_protocol = "W3C"
      + id                        = (known after apply)
      + identifier                = "applicationinsights"
      + log_client_ip             = true
      + operation_name_format     = "Name"
      + resource_group_name       = "rg-vec-eus-glo-shared-001"
      + sampling_percentage       = 5
      + verbosity                 = "information"

      + backend_request (known after apply)

      + backend_response (known after apply)

      + frontend_request {
          + body_bytes     = 32
          + headers_to_log = [
              + "accept",
              + "content-type",
              + "origin",
            ]
        }

      + frontend_response {
          + body_bytes     = 32
          + headers_to_log = [
              + "content-length",
              + "content-type",
              + "origin",
            ]
        }
    }

  # module.apim_cocktails_api.azurerm_api_management_api_operation.apim_api_version_operations["v1_GET_/accounts/owned/profile"] will be created
  + resource "azurerm_api_management_api_operation" "apim_api_version_operations" {
      + api_management_name = "apim-vec-eus-glo-shared-001"
      + api_name            = "prd-cocktails-api-v1"
      + description         = "Get the logged in users account profile"
      + display_name        = "Get Account Owned Profile"
      + id                  = (known after apply)
      + method              = "GET"
      + operation_id        = "v1-get-get-account-owned-profile"
      + resource_group_name = "rg-vec-eus-glo-shared-001"
      + url_template        = "/accounts/owned/profile"

      + request (known after apply)

      + response {
          + status_code = 200
        }
    }

  # module.apim_cocktails_api.azurerm_api_management_api_operation.apim_api_version_operations["v1_GET_/accounts/owned/profile/cocktails/ratings"] will be created
  + resource "azurerm_api_management_api_operation" "apim_api_version_operations" {
      + api_management_name = "apim-vec-eus-glo-shared-001"
      + api_name            = "prd-cocktails-api-v1"
      + description         = "Gets the account cocktail ratings for the account profile user represented within the authenticated bearer token"
      + display_name        = "Get Account Owned Profile Cocktails Ratings"
      + id                  = (known after apply)
      + method              = "GET"
      + operation_id        = "v1-get-get-account-owned-profile-cocktails-ratings"
      + resource_group_name = "rg-vec-eus-glo-shared-001"
      + url_template        = "/accounts/owned/profile/cocktails/ratings"

      + request (known after apply)

      + response {
          + status_code = 200
        }
    }

  # module.apim_cocktails_api.azurerm_api_management_api_operation.apim_api_version_operations["v1_GET_/cocktails"] will be created
  + resource "azurerm_api_management_api_operation" "apim_api_version_operations" {
      + api_management_name = "apim-vec-eus-glo-shared-001"
      + api_name            = "prd-cocktails-api-v1"
      + description         = "Gets a list of cocktails"
      + display_name        = "Get Cocktails List"
      + id                  = (known after apply)
      + method              = "GET"
      + operation_id        = "v1-get-get-cocktails-list"
      + resource_group_name = "rg-vec-eus-glo-shared-001"
      + url_template        = "/cocktails"

      + request (known after apply)

      + response {
          + status_code = 200
        }
    }

  # module.apim_cocktails_api.azurerm_api_management_api_operation.apim_api_version_operations["v1_GET_/cocktails/ingredients/filters"] will be created
  + resource "azurerm_api_management_api_operation" "apim_api_version_operations" {
      + api_management_name = "apim-vec-eus-glo-shared-001"
      + api_name            = "prd-cocktails-api-v1"
      + description         = "Get cocktails ingredients filters"
      + display_name        = "Get Cocktails Ingredients Filters"
      + id                  = (known after apply)
      + method              = "GET"
      + operation_id        = "v1-get-get-cocktails-ingredients-filters"
      + resource_group_name = "rg-vec-eus-glo-shared-001"
      + url_template        = "/cocktails/ingredients/filters"

      + request (known after apply)

      + response {
          + status_code = 200
        }
    }

  # module.apim_cocktails_api.azurerm_api_management_api_operation.apim_api_version_operations["v1_GET_/cocktails/{id}"] will be created
  + resource "azurerm_api_management_api_operation" "apim_api_version_operations" {
      + api_management_name = "apim-vec-eus-glo-shared-001"
      + api_name            = "prd-cocktails-api-v1"
      + description         = "Gets a cocktail recipe by id"
      + display_name        = "Get Cocktail"
      + id                  = (known after apply)
      + method              = "GET"
      + operation_id        = "v1-get-get-cocktail"
      + resource_group_name = "rg-vec-eus-glo-shared-001"
      + url_template        = "/cocktails/{id}"

      + request (known after apply)

      + response {
          + status_code = 200
        }

      + template_parameter {
          + name     = "id"
          + required = true
          + type     = "string"
        }
    }

  # module.apim_cocktails_api.azurerm_api_management_api_operation.apim_api_version_operations["v1_GET_/health/ping"] will be created
  + resource "azurerm_api_management_api_operation" "apim_api_version_operations" {
      + api_management_name = "apim-vec-eus-glo-shared-001"
      + api_name            = "prd-cocktails-api-v1"
      + description         = "Get health ping"
      + display_name        = "Get Ping"
      + id                  = (known after apply)
      + method              = "GET"
      + operation_id        = "v1-get-get-ping"
      + resource_group_name = "rg-vec-eus-glo-shared-001"
      + url_template        = "/health/ping"

      + request (known after apply)

      + response {
          + status_code = 200
        }
    }

  # module.apim_cocktails_api.azurerm_api_management_api_operation.apim_api_version_operations["v1_GET_/health/version"] will be created
  + resource "azurerm_api_management_api_operation" "apim_api_version_operations" {
      + api_management_name = "apim-vec-eus-glo-shared-001"
      + api_name            = "prd-cocktails-api-v1"
      + description         = "Get version"
      + display_name        = "Get Version"
      + id                  = (known after apply)
      + method              = "GET"
      + operation_id        = "v1-get-get-version"
      + resource_group_name = "rg-vec-eus-glo-shared-001"
      + url_template        = "/health/version"

      + request (known after apply)

      + response {
          + status_code = 200
        }
    }

  # module.apim_cocktails_api.azurerm_api_management_api_operation.apim_api_version_operations["v1_GET_/legal/documents/privacy-policy"] will be created
  + resource "azurerm_api_management_api_operation" "apim_api_version_operations" {
      + api_management_name = "apim-vec-eus-glo-shared-001"
      + api_name            = "prd-cocktails-api-v1"
      + description         = "Gets the privacy policy"
      + display_name        = "Get Privacy Policy"
      + id                  = (known after apply)
      + method              = "GET"
      + operation_id        = "v1-get-get-privacy-policy"
      + resource_group_name = "rg-vec-eus-glo-shared-001"
      + url_template        = "/legal/documents/privacy-policy"

      + request (known after apply)

      + response {
          + status_code = 200
        }
    }

  # module.apim_cocktails_api.azurerm_api_management_api_operation.apim_api_version_operations["v1_GET_/legal/documents/terms-of-service"] will be created
  + resource "azurerm_api_management_api_operation" "apim_api_version_operations" {
      + api_management_name = "apim-vec-eus-glo-shared-001"
      + api_name            = "prd-cocktails-api-v1"
      + description         = "Gets the terms of service"
      + display_name        = "Get Terms Of Service"
      + id                  = (known after apply)
      + method              = "GET"
      + operation_id        = "v1-get-get-terms-of-service"
      + resource_group_name = "rg-vec-eus-glo-shared-001"
      + url_template        = "/legal/documents/terms-of-service"

      + request (known after apply)

      + response {
          + status_code = 200
        }
    }

  # module.apim_cocktails_api.azurerm_api_management_api_operation.apim_api_version_operations["v1_POST_/accounts/owned/profile/cocktails/ratings"] will be created
  + resource "azurerm_api_management_api_operation" "apim_api_version_operations" {
      + api_management_name = "apim-vec-eus-glo-shared-001"
      + api_name            = "prd-cocktails-api-v1"
      + description         = "Rates a cocktail for the account profile user represented within the authenticated bearer token"
      + display_name        = "Post Account Owned Profile Cocktails Ratings"
      + id                  = (known after apply)
      + method              = "POST"
      + operation_id        = "v1-post-post-account-owned-profile-cocktails-ratings"
      + resource_group_name = "rg-vec-eus-glo-shared-001"
      + url_template        = "/accounts/owned/profile/cocktails/ratings"

      + request (known after apply)

      + response {
          + status_code = 200
        }
    }

  # module.apim_cocktails_api.azurerm_api_management_api_operation.apim_api_version_operations["v1_POST_/accounts/owned/profile/cocktails/recommendations"] will be created
  + resource "azurerm_api_management_api_operation" "apim_api_version_operations" {
      + api_management_name = "apim-vec-eus-glo-shared-001"
      + api_name            = "prd-cocktails-api-v1"
      + description         = "Send a cocktail recommendation"
      + display_name        = "Send Recommendation"
      + id                  = (known after apply)
      + method              = "POST"
      + operation_id        = "v1-post-send-recommendation"
      + resource_group_name = "rg-vec-eus-glo-shared-001"
      + url_template        = "/accounts/owned/profile/cocktails/recommendations"

      + request (known after apply)

      + response {
          + status_code = 202
        }
    }

  # module.apim_cocktails_api.azurerm_api_management_api_operation.apim_api_version_operations["v1_POST_/accounts/owned/profile/image"] will be created
  + resource "azurerm_api_management_api_operation" "apim_api_version_operations" {
      + api_management_name = "apim-vec-eus-glo-shared-001"
      + api_name            = "prd-cocktails-api-v1"
      + description         = "Uploads an account profile image for to the user represented within the authenticated bearer token"
      + display_name        = "Post Account Owned Profile Image"
      + id                  = (known after apply)
      + method              = "POST"
      + operation_id        = "v1-post-post-account-owned-profile-image"
      + resource_group_name = "rg-vec-eus-glo-shared-001"
      + url_template        = "/accounts/owned/profile/image"

      + request (known after apply)

      + response {
          + status_code = 201
        }
    }

  # module.apim_cocktails_api.azurerm_api_management_api_operation.apim_api_version_operations["v1_PUT_/accounts/owned/profile"] will be created
  + resource "azurerm_api_management_api_operation" "apim_api_version_operations" {
      + api_management_name = "apim-vec-eus-glo-shared-001"
      + api_name            = "prd-cocktails-api-v1"
      + description         = "Updates the account profile for the user represented within the authenticated bearer token"
      + display_name        = "Put Account Owned Profile"
      + id                  = (known after apply)
      + method              = "PUT"
      + operation_id        = "v1-put-put-account-owned-profile"
      + resource_group_name = "rg-vec-eus-glo-shared-001"
      + url_template        = "/accounts/owned/profile"

      + request (known after apply)

      + response {
          + status_code = 200
        }
    }

  # module.apim_cocktails_api.azurerm_api_management_api_operation.apim_api_version_operations["v1_PUT_/accounts/owned/profile/accessibility"] will be created
  + resource "azurerm_api_management_api_operation" "apim_api_version_operations" {
      + api_management_name = "apim-vec-eus-glo-shared-001"
      + api_name            = "prd-cocktails-api-v1"
      + description         = "Updates the account profile accessibility settings for the user represented within the authenticated bearer token"
      + display_name        = "Put Account Owned Profile Accessibility Settings"
      + id                  = (known after apply)
      + method              = "PUT"
      + operation_id        = "v1-put-put-account-owned-profile-accessibility-settings"
      + resource_group_name = "rg-vec-eus-glo-shared-001"
      + url_template        = "/accounts/owned/profile/accessibility"

      + request (known after apply)

      + response {
          + status_code = 200
        }
    }

  # module.apim_cocktails_api.azurerm_api_management_api_operation.apim_api_version_operations["v1_PUT_/accounts/owned/profile/cocktails/favorites"] will be created
  + resource "azurerm_api_management_api_operation" "apim_api_version_operations" {
      + api_management_name = "apim-vec-eus-glo-shared-001"
      + api_name            = "prd-cocktails-api-v1"
      + description         = "Manages the account profile favorite cocktails list for the user represented within the authenticated bearer token"
      + display_name        = "Put Account Owned Profile Cocktails Favorites"
      + id                  = (known after apply)
      + method              = "PUT"
      + operation_id        = "v1-put-put-account-owned-profile-cocktails-favorites"
      + resource_group_name = "rg-vec-eus-glo-shared-001"
      + url_template        = "/accounts/owned/profile/cocktails/favorites"

      + request (known after apply)

      + response {
          + status_code = 200
        }
    }

  # module.apim_cocktails_api.azurerm_api_management_api_operation.apim_api_version_operations["v1_PUT_/accounts/owned/profile/email"] will be created
  + resource "azurerm_api_management_api_operation" "apim_api_version_operations" {
      + api_management_name = "apim-vec-eus-glo-shared-001"
      + api_name            = "prd-cocktails-api-v1"
      + description         = "Updates the account profile email address for the user represented within the authenticated bearer token"
      + display_name        = "Put Account Owned Profile Email"
      + id                  = (known after apply)
      + method              = "PUT"
      + operation_id        = "v1-put-put-account-owned-profile-email"
      + resource_group_name = "rg-vec-eus-glo-shared-001"
      + url_template        = "/accounts/owned/profile/email"

      + request (known after apply)

      + response {
          + status_code = 200
        }
    }

  # module.apim_cocktails_api.azurerm_api_management_api_operation.apim_api_version_operations["v1_PUT_/cocktails"] will be created
  + resource "azurerm_api_management_api_operation" "apim_api_version_operations" {
      + api_management_name = "apim-vec-eus-glo-shared-001"
      + api_name            = "prd-cocktails-api-v1"
      + description         = "Puts the list of cocktails"
      + display_name        = "Put Cocktails List"
      + id                  = (known after apply)
      + method              = "PUT"
      + operation_id        = "v1-put-put-cocktails-list"
      + resource_group_name = "rg-vec-eus-glo-shared-001"
      + url_template        = "/cocktails"

      + request (known after apply)

      + response {
          + status_code = 204
        }
    }

  # module.apim_cocktails_api.azurerm_api_management_api_operation.apim_api_version_operations["v1_PUT_/cocktails/ingredients"] will be created
  + resource "azurerm_api_management_api_operation" "apim_api_version_operations" {
      + api_management_name = "apim-vec-eus-glo-shared-001"
      + api_name            = "prd-cocktails-api-v1"
      + description         = "Puts the list of ingredients"
      + display_name        = "Put Ingredients List"
      + id                  = (known after apply)
      + method              = "PUT"
      + operation_id        = "v1-put-put-ingredients-list"
      + resource_group_name = "rg-vec-eus-glo-shared-001"
      + url_template        = "/cocktails/ingredients"

      + request (known after apply)

      + response {
          + status_code = 204
        }
    }

  # module.apim_cocktails_api.azurerm_api_management_api_operation_policy.apim_api_version_operations_policy["v1_GET_/accounts/owned/profile"] will be created
  + resource "azurerm_api_management_api_operation_policy" "apim_api_version_operations_policy" {
      + api_management_name = "apim-vec-eus-glo-shared-001"
      + api_name            = "prd-cocktails-api-v1"
      + id                  = (known after apply)
      + operation_id        = "v1-get-get-account-owned-profile"
      + resource_group_name = "rg-vec-eus-glo-shared-001"
      + xml_content         = <<-EOT
            <policies>
                    <inbound>
                      <set-backend-service backend-id="prd-cocktails-api-backend" />
                      <include-fragment fragment-id="prd-cocktails-api-cors-policy" />
                    </inbound>
                    <backend><base /></backend>
                    <outbound><base /></outbound>
                    <on-error><base /></on-error>
                  </policies>
        EOT
    }

  # module.apim_cocktails_api.azurerm_api_management_api_operation_policy.apim_api_version_operations_policy["v1_GET_/accounts/owned/profile/cocktails/ratings"] will be created
  + resource "azurerm_api_management_api_operation_policy" "apim_api_version_operations_policy" {
      + api_management_name = "apim-vec-eus-glo-shared-001"
      + api_name            = "prd-cocktails-api-v1"
      + id                  = (known after apply)
      + operation_id        = "v1-get-get-account-owned-profile-cocktails-ratings"
      + resource_group_name = "rg-vec-eus-glo-shared-001"
      + xml_content         = <<-EOT
            <policies>
                    <inbound>
                      <set-backend-service backend-id="prd-cocktails-api-backend" />
                      <include-fragment fragment-id="prd-cocktails-api-cors-policy" />
                    </inbound>
                    <backend><base /></backend>
                    <outbound><base /></outbound>
                    <on-error><base /></on-error>
                  </policies>
        EOT
    }

  # module.apim_cocktails_api.azurerm_api_management_api_operation_policy.apim_api_version_operations_policy["v1_GET_/cocktails"] will be created
  + resource "azurerm_api_management_api_operation_policy" "apim_api_version_operations_policy" {
      + api_management_name = "apim-vec-eus-glo-shared-001"
      + api_name            = "prd-cocktails-api-v1"
      + id                  = (known after apply)
      + operation_id        = "v1-get-get-cocktails-list"
      + resource_group_name = "rg-vec-eus-glo-shared-001"
      + xml_content         = <<-EOT
            <policies>
                    <inbound>
                      <set-backend-service backend-id="prd-cocktails-api-backend" />
                      <include-fragment fragment-id="prd-cocktails-api-cors-policy" />
                    </inbound>
                    <backend><base /></backend>
                    <outbound><base /></outbound>
                    <on-error><base /></on-error>
                  </policies>
        EOT
    }

  # module.apim_cocktails_api.azurerm_api_management_api_operation_policy.apim_api_version_operations_policy["v1_GET_/cocktails/ingredients/filters"] will be created
  + resource "azurerm_api_management_api_operation_policy" "apim_api_version_operations_policy" {
      + api_management_name = "apim-vec-eus-glo-shared-001"
      + api_name            = "prd-cocktails-api-v1"
      + id                  = (known after apply)
      + operation_id        = "v1-get-get-cocktails-ingredients-filters"
      + resource_group_name = "rg-vec-eus-glo-shared-001"
      + xml_content         = <<-EOT
            <policies>
                    <inbound>
                      <set-backend-service backend-id="prd-cocktails-api-backend" />
                      <include-fragment fragment-id="prd-cocktails-api-cors-policy" />
                    </inbound>
                    <backend><base /></backend>
                    <outbound><base /></outbound>
                    <on-error><base /></on-error>
                  </policies>
        EOT
    }

  # module.apim_cocktails_api.azurerm_api_management_api_operation_policy.apim_api_version_operations_policy["v1_GET_/cocktails/{id}"] will be created
  + resource "azurerm_api_management_api_operation_policy" "apim_api_version_operations_policy" {
      + api_management_name = "apim-vec-eus-glo-shared-001"
      + api_name            = "prd-cocktails-api-v1"
      + id                  = (known after apply)
      + operation_id        = "v1-get-get-cocktail"
      + resource_group_name = "rg-vec-eus-glo-shared-001"
      + xml_content         = <<-EOT
            <policies>
                    <inbound>
                      <set-backend-service backend-id="prd-cocktails-api-backend" />
                      <include-fragment fragment-id="prd-cocktails-api-cors-policy" />
                    </inbound>
                    <backend><base /></backend>
                    <outbo...*[Comment body truncated]*